# Lab 5 Variation 2: HSRP with Different VLANs and Priority

## Objective
Practice HSRP configuration with different VLAN numbers, IP addressing schemes, and priority values. Reinforce redundancy and failover concepts.

## Lab Requirements

**High Availability Goals:**
1. Dual routers with HSRP for automatic failover
2. R1 as primary (priority 120)
3. R2 as backup (priority 100)
4. Transparent failover with minimal downtime

## Topology
- 1x Cisco 2960 Switch (SW-ENG-MKT)
- 2x Cisco 1941 Routers (R1 - Primary, R2 - Backup)
- 4x PCs (2 in VLAN 30, 2 in VLAN 40)
- Dual trunk links: Switch Gig0/1 ↔ R1 Gig0/0, Switch Gig0/2 ↔ R2 Gig0/0

## Network Configuration

**VLAN 30 - ENGINEERING (10.30.0.0/24)**
- PC0: 10.30.0.10
- PC1: 10.30.0.11
- R1 Interface: 10.30.0.2
- R2 Interface: 10.30.0.3
- **HSRP Virtual Gateway: 10.30.0.1**

**VLAN 40 - MARKETING (10.40.0.0/24)**
- PC2: 10.40.0.10
- PC3: 10.40.0.11
- R1 Interface: 10.40.0.2
- R2 Interface: 10.40.0.3
- **HSRP Virtual Gateway: 10.40.0.1**

**VLAN 88 - MANAGEMENT (10.88.0.0/24)**
- Switch: 10.88.0.10
- R1 Interface: 10.88.0.2
- R2 Interface: 10.88.0.3
- **HSRP Virtual Gateway: 10.88.0.1**

**Trunk Configuration:**
- Allowed VLANs: 30, 40, 88
- Native VLAN: 88

## HSRP Configuration

### Router 1 (R1 - Primary/Active, Priority 120)

```
interface gigabitethernet 0/0.30
 encapsulation dot1q 30
 ip address 10.30.0.2 255.255.255.0
 standby 30 ip 10.30.0.1
 standby 30 priority 120
 standby 30 preempt

interface gigabitethernet 0/0.40
 encapsulation dot1q 40
 ip address 10.40.0.2 255.255.255.0
 standby 40 ip 10.40.0.1
 standby 40 priority 120
 standby 40 preempt

interface gigabitethernet 0/0.88
 encapsulation dot1q 88 native
 ip address 10.88.0.2 255.255.255.0
 standby 88 ip 10.88.0.1
 standby 88 priority 120
 standby 88 preempt
```

### Router 2 (R2 - Backup/Standby, Priority 100)

```
interface gigabitethernet 0/0.30
 encapsulation dot1q 30
 ip address 10.30.0.3 255.255.255.0
 standby 30 ip 10.30.0.1
 standby 30 preempt

interface gigabitethernet 0/0.40
 encapsulation dot1q 40
 ip address 10.40.0.3 255.255.255.0
 standby 40 ip 10.40.0.1
 standby 40 preempt

interface gigabitethernet 0/0.88
 encapsulation dot1q 88 native
 ip address 10.88.0.3 255.255.255.0
 standby 88 ip 10.88.0.1
 standby 88 preempt
```

## Verification Output

### Switch

```
SW-ENG-MKT#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/5-24
30   ENGINEERING                      active    Fa0/1, Fa0/2
40   MARKETING                        active    Fa0/3, Fa0/4
88   VLAN0088                         active
```

```
SW-ENG-MKT#show interfaces trunk
Port        Mode         Encapsulation  Status        Native vlan
Gig0/1      on           802.1q         trunking      88
Gig0/2      on           802.1q         trunking      88

Port        Vlans allowed on trunk
Gig0/1      30,40,88
Gig0/2      30,40,88
```

### Router 1 (Normal Operation - Active)

```
R1#show standby brief
Interface   Grp  Pri P State    Active          Standby         Virtual IP
Gig0/0.30   30   120 P Active   local           10.30.0.3       10.30.0.1
Gig0/0.40   40   120 P Active   local           10.40.0.3       10.40.0.1
Gig0/0.88   88   120 P Active   local           10.88.0.3       10.88.0.1
```

```
R1#show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0     unassigned      YES unset  up                    up
GigabitEthernet0/0.30  10.30.0.2       YES manual up                    up
GigabitEthernet0/0.40  10.40.0.2       YES manual up                    up
GigabitEthernet0/0.88  10.88.0.2       YES manual up                    up
```

### Router 2 (Normal Operation - Standby)

```
R2#show standby brief
Interface   Grp  Pri P State    Active          Standby         Virtual IP
Gig0/0.30   30   100 P Standby  10.30.0.2       local           10.30.0.1
Gig0/0.40   40   100 P Standby  10.40.0.2       local           10.40.0.1
Gig0/0.88   88   100 P Standby  10.88.0.2       local           10.88.0.1
```

```
R2#show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0     unassigned      YES unset  up                    up
GigabitEthernet0/0.30  10.30.0.3       YES manual up                    up
GigabitEthernet0/0.40  10.40.0.3       YES manual up                    up
GigabitEthernet0/0.88  10.88.0.3       YES manual up                    up
```

## Connectivity Tests

### Normal Operation (Both Routers Up)

**From PC0 (10.30.0.10):**
- `ping 10.30.0.1` (HSRP virtual gateway) → SUCCESS
- `ping 10.40.0.10` (PC2 in VLAN 40) → SUCCESS

**From PC2 (10.40.0.10):**
- `ping 10.40.0.1` (HSRP virtual gateway) → SUCCESS
- `ping 10.30.0.10` (PC0 in VLAN 30) → SUCCESS

**Result:** All traffic flows through R1 (Active router, priority 120)

### Failover Test

**Simulate R1 failure:**
```
R1(config)# interface gigabitethernet 0/0
R1(config-if)# shutdown
```

**R2 automatically becomes Active:**
```
R2#show standby brief
Interface   Grp  Pri P State    Active          Standby         Virtual IP
Gig0/0.30   30   100 P Active   local           unknown         10.30.0.1
Gig0/0.40   40   100 P Active   local           unknown         10.40.0.1
Gig0/0.88   88   100 P Active   local           unknown         10.88.0.1
```

**Connectivity test during failover:**
- Brief interruption (1-2 ping timeouts)
- Traffic resumes through R2
- Users experience minimal downtime (~2-3 seconds)

### Recovery Test

**Bring R1 back online:**
```
R1(config)# interface gigabitethernet 0/0
R1(config-if)# no shutdown
```

**R1 reclaims Active role (preemption):**
```
R1#show standby brief
Interface   Grp  Pri P State    Active          Standby         Virtual IP
Gig0/0.30   30   120 P Active   local           10.30.0.3       10.30.0.1
Gig0/0.40   40   120 P Active   local           10.40.0.3       10.40.0.1
Gig0/0.88   88   120 P Active   local           10.88.0.3       10.88.0.1
```

**R2 returns to Standby:**
```
R2#show standby brief
Interface   Grp  Pri P State    Active          Standby         Virtual IP
Gig0/0.30   30   100 P Standby  10.30.0.2       local           10.30.0.1
Gig0/0.40   40   100 P Standby  10.40.0.2       local           10.40.0.1
Gig0/0.88   88   100 P Standby  10.88.0.2       local           10.88.0.1
```

## What Was Accomplished

✓ HSRP configured with priority 120 (R1) vs 100 (R2)
✓ Different VLAN numbering scheme (30, 40, 88 vs previous 10, 20, 99)
✓ 10.x.x.x IP addressing scheme
✓ Dual trunk links operational
✓ Virtual gateway IPs (.1) shared between routers
✓ Preemption enabled for automatic recovery
✓ Failover tested successfully (~2-3 seconds downtime)
✓ Recovery and preemption verified
✓ High availability achieved across all VLANs

## Key Differences from Lab 5 Original

| Feature | Lab 5 Original | Lab 5 Variation 2 |
|---------|---------------|-------------------|
| VLANs | 10, 20, 99 | 30, 40, 88 |
| IP Scheme | 192.168.x.0/24 | 10.x.0.0/24 |
| R1 Priority | 110 | 120 |
| R2 Priority | 100 | 100 |
| Department Names | USERS, SERVERS | ENGINEERING, MARKETING |

## Key Takeaways

**Priority Configuration:**
- R1 priority 120 (higher than original 110) - still becomes Active
- R2 priority 100 (default) - still becomes Standby
- Priority difference of 20 (vs 10 in original) - same behavior, just different values
- Any priority higher than peer makes router Active

**IP Addressing Flexibility:**
- 10.x.x.x network works identically to 192.168.x.x
- VLAN numbers (30, 40, 88) work same as any other valid VLAN IDs
- Virtual IPs can be any address in the subnet (chose .1 for consistency)

**HSRP Behavior Consistency:**
- Failover time remains ~2-3 seconds regardless of priority values
- Preemption works the same with any priority difference
- HSRP group numbers matched VLAN numbers (best practice)